CSI API ETABS v1
cAnalysisResultsSetup.SetCaseSelectedForOutput Method
 Sets a load case selected for output flag.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetCaseSelectedForOutput(
	string Name,
	bool Selected = true
)
Function SetCaseSelectedForOutput (
	Name As String,
	Optional Selected As Boolean = true
) As Integer
Dim instance As cAnalysisResultsSetup
Dim Name As String
Dim Selected As Boolean
Dim returnValue As Integer
returnValue = instance.SetCaseSelectedForOutput(Name,
	Selected)
int SetCaseSelectedForOutput(
	String^ Name,
	bool Selected = true
)
abstract SetCaseSelectedForOutput :
        Name : string *
        ?Selected : bool
(* Defaults:
        let _Selected = defaultArg Selected true
*)
-> int
Parameters
Name
Type: System.String
The name of an existing load case.
Selected (Optional)
Type: System.Boolean
This item is True if the specified load case is to be selected for output, otherwise it is False.
Return Value
Type: Int32
Returns zero if the selected flag is successfully set; otherwise it returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("DEAD")
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace